---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToGroupElems
source: html/ecb037a0-c1b9-0e1a-e682-22922da8cfff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToGroupElems Property

Revit does not allow grouping of some of the selected elements. These elements will not be included in the group.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToGroupElems { get; }
```